/*
 * Lib_A_FILT_filters.c
 *
 *  Created on: 1 мар. 2018 г.
 *      Author: m.isaev
 */



/******************************************************************************/
// Секция include: здесь подключается заголовочный файл к модулю
#include "Lib_A_FILT_filters.h"
/******************************************************************************/


/******************************************************************************/
/*============================================================================*/
// Глобальные переменные
/*============================================================================*/


/*============================================================================*/
// Локальные переменные
/*============================================================================*/
/******************************************************************************/


/******************************************************************************/
// Секция прототипов локальных функций
/******************************************************************************/


/******************************************************************************/
// Секция описания функций (сначала глобальных, потом локальных)
/*============================================================================*/
float FILT_ComplFilt_f32(
                         FILT_comp_filt_s *pStruct,
                         float value)
{
	pStruct->filtValue = pStruct->filtValue * pStruct->filtCoeff
	                    + value * (1 - pStruct->filtCoeff);

	return pStruct->filtValue;
}

float FILT_MovAverageFilt_f32(
                              FILT_moving_average_filt_s *pStruct,
                              float newValue,
                              float pValueArr[])
{
	pValueArr[pStruct->cnt] = newValue;
	
	if (pStruct->cnt < pStruct->windowWidth)
	{
		pStruct->cnt++;
	}
	else
	{
		pStruct->cnt = 0;
	}

	pStruct->newFiltValue = pStruct->preFiltValue
	                        + ((newValue - pValueArr[pStruct->cnt]))
	                          / (float) pStruct->windowWidth;

	// Текущее фильтрованное значение копируется в переменную "Фильтрованное
	// значение на шаге <t-1>";
	pStruct->preFiltValue = pStruct->newFiltValue;

	return pStruct->newFiltValue;
}
/*============================================================================*/
/******************************************************************************/


////////////////////////////////////////////////////////////////////////////////
// 	END OF FILE
////////////////////////////////////////////////////////////////////////////////
